
public class Main {
    /* * Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст;
     * Конструктор класса должен заполнять эти поля при создании объекта;
     * Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в консоль;
     * Создать массив из 5 сотрудников*/
    public static void main(String[] args) {
        employee[] employees ={
                new employee("Вася","Инженер","123@ya.ru","+79211234567",1000,29),
                new employee("КОЛЯ","Продавец","124@ya.ru","+79211234568",500,25),
                new employee("Вова","Инженер","125@ya.ru","+79211234569",1000,41),
                new employee("Глеб","Начальник","126@ya.ru","+79211234560",3000,42),
                new employee("Оля","Уборщик","127@ya.ru","+79211234566",600, 60),
        };
        for (int i = 0; i < employees.length ; i++) {
            if (employees[i].getAge() >40 ){
                employees[i].info();
            }
            
        }
    }



}
